Revit 2024 API
IFCFamilyInstanceExtrusionExportResults.MaterialId Property
 The best material id determined for the family instance.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public ElementId MaterialId { get; }
Visual Basic
Public ReadOnly Property MaterialId As ElementId
	Get
Visual C++
public:
property ElementId^ MaterialId {
	ElementId^ get ();
}
See Also
IFCFamilyInstanceExtrusionExportResults Class
Autodesk.Revit.DB.IFC Namespace